pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_grtc.h
/*
 * Copyright (c) 2023 - 2025, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef NRF_GRTC_H
#define NRF_GRTC_H

#include <nrfx.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(LUMOS_XXAA)
#if defined(NRF_APPLICATION) && defined(NRF_TRUSTZONE_NONSECURE)
#define GRTC_IRQn       GRTC_1_IRQn
#define GRTC_IRQHandler GRTC_1_IRQHandler
#elif defined(NRF_APPLICATION) && !defined(NRF_TRUSTZONE_NONSECURE)
#define GRTC_IRQn       GRTC_2_IRQn
#define GRTC_IRQHandler GRTC_2_IRQHandler
#elif defined(NRF_FLPR)
#define GRTC_IRQn       GRTC_0_IRQn
#define GRTC_IRQHandler GRTC_0_IRQHandler
#endif
#endif

#if defined(HALTIUM_XXAA)
#if (defined(ISA_ARM) && defined(NRF_TRUSTZONE_NONSECURE)) || defined(ISA_RISCV)
#define GRTC_IRQn       GRTC_0_IRQn
#define GRTC_IRQHandler GRTC_0_IRQHandler
#else
#define GRTC_IRQn       GRTC_1_IRQn
#define GRTC_IRQHandler GRTC_1_IRQHandler
#endif
#endif

/**
 * @defgroup nrf_grtc_hal GRTC HAL
 * @{
 * @ingroup nrf_grtc
 * @brief   Hardware access layer for managing the Global Real Time Counter (GRTC) peripheral.
 */

#if NRFX_CHECK(GRTC_PWMREGS) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC has PWM registers. */
#define NRF_GRTC_HAS_PWM 1
#else
#define NRF_GRTC_HAS_PWM 0
#endif

#if NRFX_CHECK(GRTC_CLKOUTREG) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC has clock output registers. */
#define NRF_GRTC_HAS_CLKOUT 1
#else
#define NRF_GRTC_HAS_CLKOUT 0
#endif

#if defined(GRTC_CLKCFG_CLKSEL_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC has clock source selection. */
#define NRF_GRTC_HAS_CLKSEL 1
#else
#define NRF_GRTC_HAS_CLKSEL 0
#endif

#if defined(GRTC_CLKCFG_CLKSEL_LFLPRC) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether RC oscillator clock source is available. */
#define NRF_GRTC_HAS_CLKSEL_LFLPRC 1
#else
#define NRF_GRTC_HAS_CLKSEL_LFLPRC 0
#endif

#if defined(GRTC_SYSCOUNTER_SYSCOUNTERL_VALUE_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC has multiple SYSCOUNTER registers. */
#define NRF_GRTC_HAS_SYSCOUNTER_ARRAY 1
#else
#define NRF_GRTC_HAS_SYSCOUNTER_ARRAY 0
#endif

#if defined(GRTC_EVENTS_SYSCOUNTERVALID_EVENTS_SYSCOUNTERVALID_Msk) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether SYSCOUNTERVALID event is present. */
#define NRF_GRTC_HAS_SYSCOUNTERVALID 1
#else
#define NRF_GRTC_HAS_SYSCOUNTERVALID 0
#endif

#if defined(GRTC_KEEPRUNNING_DOMAIN0_Msk) || defined(GRTC_KEEPRUNNING_REQUEST0_Msk) || \
    defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether KEEPRUNNING register is present. */
#define NRF_GRTC_HAS_KEEPRUNNING 1
#else
#define NRF_GRTC_HAS_KEEPRUNNING 0
#endif

#if defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC has RTCOUNTER. */
#define NRF_GRTC_HAS_RTCOUNTER 1
#elif !defined(NRF_GRTC_HAS_RTCOUNTER)
#define NRF_GRTC_HAS_RTCOUNTER 0
#endif

#if !defined(NRF_GRTC_HAS_EXTENDED)
#if defined(LUMOS_XXAA) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC has extended functionality. */
#define NRF_GRTC_HAS_EXTENDED 1
#else
#define NRF_GRTC_HAS_EXTENDED 0
#endif
#endif // !defined(NRF_GRTC_HAS_EXTENDED)

#if defined(GRTC_IRQ_GROUP) || defined(__NRFX_DOXYGEN__)
/** @brief Symbol indicating whether GRTC interrupt groups are present. */
#define NRF_GRTC_HAS_INT_GROUPS 1
#else
#define NRF_GRTC_HAS_INT_GROUPS 0
#endif

/** @brief Symbol indicating actual domain index. */
#define NRF_GRTC_DOMAIN_INDEX GRTC_IRQ_GROUP

/** @brief Symbol indicating actual SYSCOUNTER index. */
#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
    #define GRTC_SYSCOUNTER SYSCOUNTER[NRF_GRTC_DOMAIN_INDEX]
#endif

/** @brief Number of capture/compare channels for SYSCOUNTER. */
#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
    #define NRF_GRTC_SYSCOUNTER_COUNT GRTC_SYSCOUNTER_MaxCount
#endif

/** @brief Interrupts INTEN register definition. */
#define GRTC_INTEN        NRFX_CONCAT_2(INTEN, GRTC_IRQ_GROUP)
/** @brief Interrupts INTENSET register definition. */
#define GRTC_INTENSET     NRFX_CONCAT_2(INTENSET, GRTC_IRQ_GROUP)
/** @brief Interrupts INTENCLR register definition. */
#define GRTC_INTENCLR     NRFX_CONCAT_2(INTENCLR, GRTC_IRQ_GROUP)
/** @brief Interrupts INTPEND register definition. */
#define GRTC_INTPEND      NRFX_CONCAT_2(INTPEND, GRTC_IRQ_GROUP)

/** @brief Main SYSCOUNTER frequency in Hz. */
#define NRF_GRTC_SYSCOUNTER_MAIN_FREQUENCY_HZ 1000000UL

/** @brief Number of capture/compare channels for SYSCOUNTER. */
#define NRF_GRTC_SYSCOUNTER_CC_COUNT GRTC_CC_MaxCount

/** @brief Bitmask of the higher 32-bits of capture/compare register for the SYSCOUNTER. */
#define NRF_GRTC_SYSCOUNTER_CCH_MASK GRTC_CC_CCH_CCH_Msk

/** @brief Bitmask of CCADD register for the SYSCOUNTER. */
#define NRF_GRTC_SYSCOUNTER_CCADD_MASK GRTC_CC_CCADD_VALUE_Msk

