pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_grtc.h
#if NRF_GRTC_HAS_CLKOUT
/** @brief Configuration of clock output. */
typedef enum
{
    NRF_GRTC_CLKOUT_32K  = GRTC_CLKOUT_CLKOUT32K_Msk,
    NRF_GRTC_CLKOUT_FAST = GRTC_CLKOUT_CLKOUTFAST_Msk,
} nrf_grtc_clkout_t;
#endif

#if NRF_GRTC_HAS_CLKSEL
/** @brief Configuration of the GRTC clock source selection. */
typedef enum
{
    NRF_GRTC_CLKSEL_LFXO  = GRTC_CLKCFG_CLKSEL_LFXO,
    NRF_GRTC_CLKSEL_LFCLK = GRTC_CLKCFG_CLKSEL_SystemLFCLK,
#if NRF_GRTC_HAS_CLKSEL_LFLPRC
    NRF_GRTC_CLKSEL_LFLPRC = GRTC_CLKCFG_CLKSEL_LFLPRC,
#endif
} nrf_grtc_clksel_t;
#endif

/**
 * @brief Function for setting the compare value of channel for the SYSCOUNTER.
 *
 * @note The corresponding event is automatically disabled by hardware during the operation.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] cc_channel The specified capture/compare channel.
 * @param[in] cc_value   Compare value to be set in 1 MHz units.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_cc_set(NRF_GRTC_Type * p_reg,
                                                   uint8_t         cc_channel,
                                                   uint64_t        cc_value);

/**
 * @brief Function for getting the capture/compare value of channel for the SYSCOUNTER.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] cc_channel The specified capture/compare channel.
 *
 * @return Value from the specified capture/compare register in 1MHz units.
 */
NRF_STATIC_INLINE uint64_t nrf_grtc_sys_counter_cc_get(NRF_GRTC_Type const * p_reg,
                                                       uint8_t               cc_channel);

/**
 * @brief Function for setting the value to be added to capture/compare register for
 *        the SYSCOUNTER.
 *
 * @note There are two available configurations of adding operation:
 *       When @p reference value equals @ref NRF_GRTC_CC_ADD_REFERENCE_SYSCOUNTER then
 *       the final value of capture/compare register is a sum of SYSCOUNTER current value
 *       and @p value.
 *       When @p reference value equals @ref NRF_GRTC_CC_ADD_REFERENCE_CC then
 *       the final value of capture/compare register is a sum of current capture/compare
 *       value and @p value.
 *       If the capture/compare register overflows after this write, then the corresponding event
 *       is generated immediately.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] cc_channel The specified capture/compare channel.
 * @param[in] value      Value to be added in 1 MHz units.
 * @param[in] reference  Configuration of adding mode.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_cc_add_set(NRF_GRTC_Type *             p_reg,
                                                       uint8_t                     cc_channel,
                                                       uint32_t                    value,
                                                       nrf_grtc_cc_add_reference_t reference);

#if NRF_GRTC_HAS_RTCOUNTER
/**
 * @brief Function for setting a compare value for the RTCOUNTER.
 *
 * @note The internal synchronization mechanism ensures that the desired value will be properly
 *       latched by the GRTC. However when @p sync parameter is true then the process of capturing
 *       the value lasts up to two 32 kHz cycles.
 *       If the @p sync parameter is false then the capturing the value will occur on the
 *       following rising edge of 32 kHz clock. In this case it is user's responsibility
 *       to execute the function between the 32 kHz rising edges.
 *
 * @param[in] p_reg    Pointer to the structure of registers of the peripheral.
 * @param[in] cc_value Compare value to be set in 32 kHz units.
 * @param[in] sync     True if the internal synchronization mechanism shall be used,
 *                     false otherwise.
 */
NRF_STATIC_INLINE void nrf_grtc_rt_counter_cc_set(NRF_GRTC_Type * p_reg,
                                                  uint64_t        cc_value,
                                                  bool            sync);

/**
 * @brief Function for returning the compare value for the RTCOUNTER.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Value from the capture/compare register in 32 kHz units.
 */
NRF_STATIC_INLINE uint64_t nrf_grtc_rt_counter_cc_get(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_RTCOUNTER

/**
 * @brief Function for enabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be enabled.
 *                  Use @ref nrf_grtc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_grtc_int_enable(NRF_GRTC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for disabling specified interrupts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be disabled.
 *                  Use @ref nrf_grtc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_grtc_int_disable(NRF_GRTC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for checking if the specified interrupts are enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of interrupts to be checked.
 *                  Use @ref nrf_grtc_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_int_enable_check(NRF_GRTC_Type const * p_reg, uint32_t mask);

/**
 * @brief Function for retrieving the state of pending interrupts.
 *
 * @note States of pending interrupt are saved as a bitmask.
 *       One set at particular position means that interrupt for event is pending.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Bitmask with information about pending interrupts.
 *         Use @ref nrf_grtc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_int_pending_get(NRF_GRTC_Type const * p_reg);

#if NRF_GRTC_HAS_INT_GROUPS
/**
 * @brief Function for enabling interrupts in the specified group.
 *
 * @note Not all @p group_idx might be valid.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be enabled.
 * @param[in] mask      Mask of interrupts to be enabled.
 *                      Use @ref nrf_grtc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_grtc_int_group_enable(NRF_GRTC_Type * p_reg,
                                                 uint8_t         group_idx,
                                                 uint32_t        mask);

/**
 * @brief Function for disabling interrupts in the specified group.
 *
 * @note Not all @p group_idx might be valid.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be disabled.
 * @param[in] mask      Mask of interrupts to be disabled.
 *                      Use @ref nrf_grtc_int_mask_t values for bit masking.
 */
NRF_STATIC_INLINE void nrf_grtc_int_group_disable(NRF_GRTC_Type * p_reg,
                                                  uint8_t         group_idx,
                                                  uint32_t        mask);

/**
 * @brief Function for checking if the specified interrupts from a given group are enabled.
 *
 * @note Not all @p group_idx might be valid.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg     Pointer to the structure of registers of the peripheral.
 * @param[in] group_idx Index of interrupt group to be checked.
 * @param[in] mask      Mask of interrupts to be checked.
 *                      Use @ref nrf_grtc_int_mask_t values for bit masking.
 *
 * @return Mask of enabled interrupts.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_int_group_enable_check(NRF_GRTC_Type const * p_reg,
                                                           uint8_t               group_idx,
                                                           uint32_t              mask);
#endif // NRF_GRTC_HAS_INT_GROUPS

#if NRF_GRTC_HAS_PWM
/**
 * @brief Function for enabling events.
 *
 * @note Only specific events can be individually enabled or disabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of event flags to be enabled.
 */
NRF_STATIC_INLINE void nrf_grtc_event_enable(NRF_GRTC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for disabling events.
 *
 * @note Only specific events can be individually enabled or disabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Mask of event flags to be disabled.
 */
NRF_STATIC_INLINE void nrf_grtc_event_disable(NRF_GRTC_Type * p_reg, uint32_t mask);
#endif // NRF_GRTC_HAS_PWM

#if NRF_GRTC_HAS_EXTENDED
/**
 * @brief Function for enabling the specified shortcuts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Bitmask of shortcuts to be enabled.
 */
NRF_STATIC_INLINE void nrf_grtc_shorts_enable(NRF_GRTC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for disabling the specified shortcuts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Bitmask of shortcuts to be disabled.
 */
NRF_STATIC_INLINE void nrf_grtc_shorts_disable(NRF_GRTC_Type * p_reg, uint32_t mask);

/**
 * @brief Function for setting the specified shortcuts.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Bitmask of shortcuts to be set.
 */
NRF_STATIC_INLINE void nrf_grtc_shorts_set(NRF_GRTC_Type * p_reg, uint32_t mask);
#endif // NRF_GRTC_HAS_EXTENDED

/**
 * @brief Function for setting the subscribe configuration for a given
 *        GRTC task.
 *
 * @note Not every task has its corresponding subscribe register.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] task    Task for which to set the configuration.
 * @param[in] channel Channel through which to subscribe events.
 */
NRF_STATIC_INLINE void nrf_grtc_subscribe_set(NRF_GRTC_Type * p_reg,
                                              nrf_grtc_task_t task,
                                              uint8_t         channel);

/**
 * @brief Function for clearing the subscribe configuration for a given
 *        GRTC task.
 *
 * @note Not every task has its corresponding subscribe register.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Task for which to clear the configuration.
 */
NRF_STATIC_INLINE void nrf_grtc_subscribe_clear(NRF_GRTC_Type * p_reg,
                                                nrf_grtc_task_t task);

/**
 * @brief Function for setting the publish configuration for a given
 *        GRTC event.
 *
 * @note Not every event has its corresponding publish register.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg   Pointer to the structure of registers of the peripheral.
 * @param[in] event   Event for which to set the configuration.
 * @param[in] channel Channel through which to publish the event.
 */
NRF_STATIC_INLINE void nrf_grtc_publish_set(NRF_GRTC_Type *  p_reg,
                                            nrf_grtc_event_t event,
                                            uint8_t          channel);

/**
 * @brief Function for clearing the publish configuration for a given
 *        GRTC event.
 *
 * @note Not every event has its corresponding publish register.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event for which to clear the configuration.
 */
NRF_STATIC_INLINE void nrf_grtc_publish_clear(NRF_GRTC_Type *  p_reg,
                                              nrf_grtc_event_t event);

/**
 * @brief Function for retrieving the state of the GRTC event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be checked.
 *
 * @retval true  The event has been generated.
 * @retval false The event has not been generated.
 */
NRF_STATIC_INLINE bool nrf_grtc_event_check(NRF_GRTC_Type const * p_reg, nrf_grtc_event_t event);

/**
 * @brief Function for clearing an event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Event to be cleared.
 */
NRF_STATIC_INLINE void nrf_grtc_event_clear(NRF_GRTC_Type * p_reg, nrf_grtc_event_t event);

#if NRF_GRTC_HAS_RTCOUNTER
/**
 * @brief Function for returning the lower 32-bits of RTCOUNTER value.
 *
 * @note The whole RTCOUNTER value is latched when @ref nrf_grtc_rt_counter_low_get function
 *       is executed. Thus @ref nrf_grtc_rt_counter_low_get must be executed before calling
 *       @ref nrf_grtc_rt_counter_high_get.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Lower part of RTCOUNTER value.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_rt_counter_low_get(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for returning the higher 32-bits of RTCOUNTER value.
 *
 * @note The whole RTCOUNTER value is latched when @ref nrf_grtc_rt_counter_low_get function
 *       is executed. Thus @ref nrf_grtc_rt_counter_low_get must be executed before calling
 *       @ref nrf_grtc_rt_counter_high_get.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Higher part of RTCOUNTER value.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_rt_counter_high_get(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_RTCOUNTER

/**
 * @brief Function for returning the lower 32-bits of SYSCOUNTER value.
 *
 * @note @ref nrf_grtc_sys_counter_low_get must be executed before calling
 *       @ref nrf_grtc_sys_counter_high_get. In addition, after this,
 *       @ref nrf_grtc_sys_counter_overflow_check should be called. If it retuns true,
 *       whole procedure should be repeated.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Lower part of SYSCOUNTER value.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_sys_counter_low_get(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for returning the higher 32-bits of SYSCOUNTER value.
 *
 * @note @ref nrf_grtc_sys_counter_low_get must be executed before calling
 *       @ref nrf_grtc_sys_counter_high_get. In addition, after this,
 *       @ref nrf_grtc_sys_counter_overflow_check should be called. If it retuns true,
 *       whole procedure should be repeated.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Higher part SYSCOUNTER value.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_sys_counter_high_get(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for returning the 64-bit SYSCOUNTER value.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return SYSCOUNTER value.
 */
NRF_STATIC_INLINE uint64_t nrf_grtc_sys_counter_get(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for checking whether the lower 32-bits of SYSCOUNTER overflowed after
 *        last execution of @ref nrf_grtc_sys_counter_low_get.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval True if the lower 32-bits of SYSCOUNTER overflowed, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_grtc_sys_counter_overflow_check(NRF_GRTC_Type const * p_reg);

#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
/**
 * @brief Function for returning the 64-bit SYSCOUNTER value of the specified index.
 *
 * @note Not all @p index might be valid.
 *       Refer to the Product Specification for more information.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] index Index of SYSCOUNTER value to be read.
 *
 * @return SYSCOUNTER value of specified index.
 */
NRF_STATIC_INLINE uint64_t nrf_grtc_sys_counter_indexed_get(NRF_GRTC_Type const * p_reg,
                                                            uint8_t               index);

/**
 * @brief Function for setting the request to keep the specified SYSCOUNTER channel active.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if the SYSCOUNTER channel is to be kept active, false otherwise.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_active_set(NRF_GRTC_Type * p_reg, bool enable);

/**
 * @brief Function for checking whether the specified SYSCOUNTER channel is requested to remain active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval True if SYSCOUNTER channel is requested to remain active, false otherwise.
 */
NRF_STATIC_INLINE
bool nrf_grtc_sys_counter_active_check(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_SYSCOUNTER_ARRAY

/**
 * @brief Function for returning the address of an event.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] event Requested event.
 *
 * @return Address of the requested event register.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_event_address_get(NRF_GRTC_Type const * p_reg,
                                                      nrf_grtc_event_t      event);

/**
 * @brief Function for returning the address of a task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Requested task.
 *
 * @return Address of the requested task register.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_task_address_get(NRF_GRTC_Type const * p_reg,
                                                     nrf_grtc_task_t       task);

/**
 * @brief Function for starting a task.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] task  Requested task.
 */
NRF_STATIC_INLINE void nrf_grtc_task_trigger(NRF_GRTC_Type * p_reg, nrf_grtc_task_t task);

/**
 * @brief Function for getting the 1 MHz SYSCOUNTER timer capture task associated with the
 *        specified channel.
 *
 * @param[in] cc_channel Capture channel.
 *
 * @return Capture task.
 */
NRF_STATIC_INLINE nrf_grtc_task_t nrf_grtc_sys_counter_capture_task_get(uint8_t cc_channel);

/**
 * @brief Function for enabling SYSCOUNTER compare event.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] cc_channel Channel number of compare event to be enabled.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_compare_event_enable(NRF_GRTC_Type * p_reg,
                                                                 uint8_t         cc_channel);

/**
 * @brief Function for disabling SYSCOUNTER compare event.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] cc_channel Channel number of compare event to be disabled.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_compare_event_disable(NRF_GRTC_Type * p_reg,
                                                                  uint8_t         cc_channel);

/**
 * @brief Function for getting the SYSCOUNTER compare event associated with the specified
 *        compare cc_channel.
 *
 * @param[in] cc_channel Compare channel number.
 *
 * @return Requested compare event.
 */
NRF_STATIC_INLINE nrf_grtc_event_t nrf_grtc_sys_counter_compare_event_get(uint8_t cc_channel);

/**
 * @brief Function for checking whether the specified capture/compare channel is enabled.
 *
 * @param[in] p_reg      Pointer to the structure of registers of the peripheral.
 * @param[in] cc_channel Channel to be checked.
 *
 * @retval true  Specified channel is enabled.
 * @retval false Specified channel is disabled.
 */
NRF_STATIC_INLINE bool nrf_grtc_sys_counter_cc_enable_check(NRF_GRTC_Type const * p_reg,
                                                            uint8_t               cc_channel);

#if NRF_GRTC_HAS_EXTENDED
/**
 * @brief Function for setting the SYSCOUNTER.
 *
 * @note When the SYSCOUNTER is disabled the GRTC uses RTCOUNTER by default.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if SYSCOUNTER is to be enabled, false otherwise.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_set(NRF_GRTC_Type * p_reg, bool enable);

/**
 * @brief Function for setting automatic mode for the SYSCOUNTER.
 *
 * @note When @p enable is false then the SYSCOUNTER remains active when KEEPRUNNING is set,
 *       or any task register, INT register or SYSCOUNTER register is being accessed.
 *       When @p enable is true then in addition the SYSCOUNTER remains active when
 *       any local CPU that is not sleeping keeps the SYSCOUNTER active.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if the automatic mode is to be enabled, false otherwise.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_auto_mode_set(NRF_GRTC_Type * p_reg, bool enable);

/**
 * @brief Function for checking whether the SYSCOUNTER has automatic mode enabled.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return True  Automatic mode is enabled.
 * @return False Automatic mode is disabled.
 */
NRF_STATIC_INLINE bool nrf_grtc_sys_counter_auto_mode_check(NRF_GRTC_Type * p_reg);
#endif // NRF_GRTC_HAS_EXTENDED

/**
 * @brief Function for checking whether the SYSCOUNTER is in active state.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval True if the SYSCOUNTER is active, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_grtc_sys_counter_check(NRF_GRTC_Type const * p_reg);

