pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_grtc.h
#if NRF_GRTC_HAS_KEEPRUNNING
/**
 * @brief Function for setting the request to keep the SYSCOUNTER active.
 *
 * @note This function modifies the KEEPRUNNING register, which possesses information
 *       whether any local CPU needs keeping the SYSCOUNTER active.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] enable True if the automatic mode is to be enabled, false otherwise.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_active_state_request_set(NRF_GRTC_Type * p_reg,
                                                                     bool            enable);

/**
 * @brief Function for checking whether the SYSCOUNTER is requested to remain active.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 *
 * @retval True if request for keeping the SYSCOUNTER is active, false otherwise.
 */
NRF_STATIC_INLINE
bool nrf_grtc_sys_counter_active_state_request_check(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for getting the domains that requested the SYSCOUNTER to remain active.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] mask  Domains mask.
 *
 * @retval Bitmask of domains that keep the SYSCOUNTER active.
 */
NRF_STATIC_INLINE
uint32_t nrf_grtc_sys_counter_active_state_request_get(NRF_GRTC_Type const * p_reg,
                                                       uint32_t              mask);
#endif // NRF_GRTC_HAS_KEEPRUNNING

#if NRF_GRTC_HAS_EXTENDED
/**
 * @brief Function for setting the periodic compare event for capture/compare channel 0.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] value Period value in 1 MHz units.
 */
NRF_STATIC_INLINE void nrf_grtc_sys_counter_interval_set(NRF_GRTC_Type * p_reg, uint32_t value);

/**
 * @brief Function for getting the value of interval for periodic capture/compare event
 *        for channel 0.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval Value of the interval in 1 MHz units.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_sys_counter_interval_get(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for setting the timeout value for GRTC.
 *
 * @note Timeout between all CPUs going to sleep and stopping the SYSCOUNTER.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] value Timeout value in 32 kHz units.
 */
NRF_STATIC_INLINE void nrf_grtc_timeout_set(NRF_GRTC_Type * p_reg, uint32_t value);

/**
 * @brief Function for getting the value of the timeout value for GRTC.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval Value of the timeout in 32 kHz units.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_timeout_get(NRF_GRTC_Type const * p_reg);

/**
 * @brief Function for setting the wake time value for GRTC.
 *
 * @note The wake time is maximum number of 32 kHz cycles takes to restore the APB registers
 *       when waking from sleep state.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] value Wake time value in 32 kHz units.
 */
NRF_STATIC_INLINE void nrf_grtc_waketime_set(NRF_GRTC_Type * p_reg, uint32_t value);

/**
 * @brief Function for getting the wake time value.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval Value of wake time in 32 kHz units.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_waketime_get(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_EXTENDED

#if NRF_GRTC_HAS_PWM
/**
 * @brief Function for setting the PWM compare value.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] value PWM compare value.
 */
NRF_STATIC_INLINE void nrf_grtc_pwm_compare_set(NRF_GRTC_Type * p_reg, uint32_t value);

/**
 * @brief Function for getting the PWM compare value.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval Value of PWM compare.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_pwm_compare_get(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_PWM

#if NRF_GRTC_HAS_CLKOUT
/**
 * @brief Function for setting the specified clock source to be connected to output pin.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] clkout Selected clkout source.
 * @param[in] enable True if the clkout source is to be enabled, false otherwise.
 */
NRF_STATIC_INLINE void nrf_grtc_clkout_set(NRF_GRTC_Type *   p_reg,
                                           nrf_grtc_clkout_t clkout,
                                           bool              enable);

/**
 * @brief Function for checking whether clock source is connected to clkout pin.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] clkout Selected clkout source.
 *
 * @retval True if the clkout source is enabled, false otherwise.
 */
NRF_STATIC_INLINE bool nrf_grtc_clkout_enable_check(NRF_GRTC_Type const * p_reg,
                                                    nrf_grtc_clkout_t     clkout);

/**
 * @brief Function for setting the fast clock divisor value of clock output.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 * @param[in] value Fast clock divisor value.
 */
NRF_STATIC_INLINE void nrf_grtc_clkout_divider_set(NRF_GRTC_Type * p_reg, uint32_t value);

/**
 * @brief Function for getting the fast clock divisor value of clock output.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @retval Fast clock divisor value.
 */
NRF_STATIC_INLINE uint32_t nrf_grtc_clkout_divider_get(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_CLKOUT

#if NRF_GRTC_HAS_CLKSEL
/**
 * @brief Function for setting the clock source for the GRTC low-frequency clock.
 *
 * @param[in] p_reg  Pointer to the structure of registers of the peripheral.
 * @param[in] clksel Selected clock source.
 */
NRF_STATIC_INLINE void nrf_grtc_clksel_set(NRF_GRTC_Type * p_reg, nrf_grtc_clksel_t clksel);

/**
 * @brief Function for getting the clock source of the GRTC low-frequency clock.
 *
 * @param[in] p_reg Pointer to the structure of registers of the peripheral.
 *
 * @return Clock source configuration.
 */
NRF_STATIC_INLINE nrf_grtc_clksel_t nrf_grtc_clksel_get(NRF_GRTC_Type const * p_reg);
#endif // NRF_GRTC_HAS_CLKSEL

#ifndef NRF_DECLARE_ONLY

NRF_STATIC_INLINE void nrf_grtc_sys_counter_cc_set(NRF_GRTC_Type * p_reg,
                                                   uint8_t         cc_channel,
                                                   uint64_t        cc_value)
{
#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
#else
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT &&
                cc_channel > NRF_GRTC_MAIN_CC_CHANNEL);
#endif
    uint32_t cc_h = (uint32_t)(cc_value >> 32);
    NRFX_ASSERT(cc_h <= NRF_GRTC_SYSCOUNTER_CCH_MASK);

