pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_grtc.h
    p_reg->CC[cc_channel].CCL = (uint32_t)cc_value;
    p_reg->CC[cc_channel].CCH = cc_h & NRF_GRTC_SYSCOUNTER_CCH_MASK;
}

NRF_STATIC_INLINE uint64_t nrf_grtc_sys_counter_cc_get(NRF_GRTC_Type const * p_reg,
                                                       uint8_t               cc_channel)
{
#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
#else
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT &&
                cc_channel > NRF_GRTC_MAIN_CC_CHANNEL);
#endif
    uint32_t cc_h = p_reg->CC[cc_channel].CCH;

    return (uint64_t)p_reg->CC[cc_channel].CCL | ((uint64_t)cc_h << 32);
}

NRF_STATIC_INLINE void nrf_grtc_sys_counter_cc_add_set(NRF_GRTC_Type *             p_reg,
                                                       uint8_t                     cc_channel,
                                                       uint32_t                    value,
                                                       nrf_grtc_cc_add_reference_t reference)
{
#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
#else
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT &&
                cc_channel > NRF_GRTC_MAIN_CC_CHANNEL);
#endif
    NRFX_ASSERT(value <= NRF_GRTC_SYSCOUNTER_CCADD_MASK);

    p_reg->CC[cc_channel].CCADD = ((uint32_t)reference << GRTC_CC_CCADD_REFERENCE_Pos) |
                               (value & NRF_GRTC_SYSCOUNTER_CCADD_MASK);
}

#if NRF_GRTC_HAS_RTCOUNTER
NRF_STATIC_INLINE void nrf_grtc_rt_counter_cc_set(NRF_GRTC_Type * p_reg,
                                                  uint64_t        cc_value,
                                                  bool            sync)
{
    uint32_t cc_h = (uint32_t)(cc_value >> 32);
    NRFX_ASSERT(cc_h <= NRF_GRTC_RTCOUNTER_CCH_MASK);

    if (sync)
    {
        p_reg->RTCOMPARESYNCL = (uint32_t)cc_value;
        p_reg->RTCOMPARESYNCH = cc_h & NRF_GRTC_RTCOUNTER_CCH_MASK;
    }
    else
    {
        p_reg->RTCOMPAREL = (uint32_t)cc_value;
        p_reg->RTCOMPAREH = cc_h & NRF_GRTC_RTCOUNTER_CCH_MASK;
    }
}

NRF_STATIC_INLINE uint64_t nrf_grtc_rt_counter_cc_get(NRF_GRTC_Type const * p_reg)
{
    uint32_t cc_h = p_reg->RTCOMPAREH;

    return (uint64_t)p_reg->RTCOMPAREL | ((uint64_t)cc_h << 32);
}
#endif // NRF_GRTC_HAS_RTCOUNTER

NRF_STATIC_INLINE void nrf_grtc_int_enable(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->GRTC_INTENSET = mask;
}

NRF_STATIC_INLINE void nrf_grtc_int_disable(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->GRTC_INTENCLR = mask;
}

NRF_STATIC_INLINE uint32_t nrf_grtc_int_enable_check(NRF_GRTC_Type const * p_reg, uint32_t mask)
{
    return p_reg->GRTC_INTEN & mask;
}

NRF_STATIC_INLINE uint32_t nrf_grtc_int_pending_get(NRF_GRTC_Type const * p_reg)
{
    return p_reg->GRTC_INTPEND;
}

#if NRF_GRTC_HAS_INT_GROUPS
NRF_STATIC_INLINE void nrf_grtc_int_group_enable(NRF_GRTC_Type * p_reg,
                                                 uint8_t         group_idx,
                                                 uint32_t        mask)
{
    switch (group_idx)
    {
        case 0:
            p_reg->INTENSET0 = mask;
            break;
        case 1:
            p_reg->INTENSET1 = mask;
            break;
#if defined(GRTC_INTENSET2_COMPARE0_Msk)
        case 2:
            p_reg->INTENSET2 = mask;
            break;
#endif
#if defined(GRTC_INTENSET3_COMPARE0_Msk)
        case 3:
            p_reg->INTENSET3 = mask;
            break;
#endif
#if defined(GRTC_INTENSET4_COMPARE0_Msk)
        case 4:
            p_reg->INTENSET4 = mask;
            break;
#endif
#if defined(GRTC_INTENSET5_COMPARE0_Msk)
        case 5:
            p_reg->INTENSET5 = mask;
            break;
#endif
#if defined(GRTC_INTENSET6_COMPARE0_Msk)
        case 6:
            p_reg->INTENSET6 = mask;
            break;
#endif
#if defined(GRTC_INTENSET7_COMPARE0_Msk)
        case 7:
            p_reg->INTENSET7 = mask;
            break;
#endif
#if defined(GRTC_INTENSET8_COMPARE0_Msk)
        case 8:
            p_reg->INTENSET8 = mask;
            break;
#endif
#if defined(GRTC_INTENSET9_COMPARE0_Msk)
        case 9:
            p_reg->INTENSET9 = mask;
            break;
#endif
#if defined(GRTC_INTENSET10_COMPARE0_Msk)
        case 10:
            p_reg->INTENSET10 = mask;
            break;
#endif
#if defined(GRTC_INTENSET11_COMPARE0_Msk)
        case 11:
            p_reg->INTENSET11 = mask;
            break;
#endif
#if defined(GRTC_INTENSET12_COMPARE0_Msk)
        case 12:
            p_reg->INTENSET12 = mask;
            break;
#endif
#if defined(GRTC_INTENSET13_COMPARE0_Msk)
        case 13:
            p_reg->INTENSET13 = mask;
            break;
#endif
#if defined(GRTC_INTENSET14_COMPARE0_Msk)
        case 14:
            p_reg->INTENSET14 = mask;
            break;
#endif
#if defined(GRTC_INTENSET15_COMPARE0_Msk)
        case 15:
            p_reg->INTENSET15 = mask;
            break;
#endif
       default:
            NRFX_ASSERT(false);
            break;
    }
}

NRF_STATIC_INLINE void nrf_grtc_int_group_disable(NRF_GRTC_Type * p_reg,
                                                  uint8_t         group_idx,
                                                  uint32_t        mask)
{
    switch (group_idx)
    {
        case 0:
            p_reg->INTENCLR0 = mask;
            break;
        case 1:
            p_reg->INTENCLR1 = mask;
            break;
#if defined(GRTC_INTENCLR2_COMPARE0_Msk)
        case 2:
            p_reg->INTENCLR2 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR3_COMPARE0_Msk)
        case 3:
            p_reg->INTENCLR3 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR4_COMPARE0_Msk)
        case 4:
            p_reg->INTENCLR4 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR5_COMPARE0_Msk)
        case 5:
            p_reg->INTENCLR5 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR6_COMPARE0_Msk)
        case 6:
            p_reg->INTENCLR6 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR7_COMPARE0_Msk)
        case 7:
            p_reg->INTENCLR7 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR8_COMPARE0_Msk)
        case 8:
            p_reg->INTENCLR8 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR9_COMPARE0_Msk)
        case 9:
            p_reg->INTENCLR9 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR10_COMPARE0_Msk)
        case 10:
            p_reg->INTENCLR10 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR11_COMPARE0_Msk)
        case 11:
            p_reg->INTENCLR11 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR12_COMPARE0_Msk)
        case 12:
            p_reg->INTENCLR12 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR13_COMPARE0_Msk)
        case 13:
            p_reg->INTENCLR13 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR14_COMPARE0_Msk)
        case 14:
            p_reg->INTENCLR14 = mask;
            break;
#endif
#if defined(GRTC_INTENCLR15_COMPARE0_Msk)
        case 15:
            p_reg->INTENCLR15 = mask;
            break;
#endif
       default:
            NRFX_ASSERT(false);
            break;
    }
}

NRF_STATIC_INLINE uint32_t nrf_grtc_int_group_enable_check(NRF_GRTC_Type const * p_reg,
                                                           uint8_t               group_idx,
                                                           uint32_t              mask)
{
    switch (group_idx)
    {
        case 0:
            return p_reg->INTENSET0 & mask;
        case 1:
            return p_reg->INTENSET1 & mask;
#if defined(GRTC_INTENSET2_COMPARE0_Msk)
        case 2:
            return p_reg->INTENSET2 & mask;
#endif
#if defined(GRTC_INTENSET3_COMPARE0_Msk)
        case 3:
            return p_reg->INTENSET3 & mask;
#endif
#if defined(GRTC_INTENSET4_COMPARE0_Msk)
        case 4:
            return p_reg->INTENSET4 & mask;
#endif
#if defined(GRTC_INTENSET5_COMPARE0_Msk)
        case 5:
            return p_reg->INTENSET5 & mask;
#endif
#if defined(GRTC_INTENSET6_COMPARE0_Msk)
        case 6:
            return p_reg->INTENSET6 & mask;
#endif
#if defined(GRTC_INTENSET7_COMPARE0_Msk)
        case 7:
            return p_reg->INTENSET7 & mask;
#endif
#if defined(GRTC_INTENSET8_COMPARE0_Msk)
        case 8:
            return p_reg->INTENSET8 & mask;
#endif
#if defined(GRTC_INTENSET9_COMPARE0_Msk)
        case 9:
            return p_reg->INTENSET9 & mask;
#endif
#if defined(GRTC_INTENSET10_COMPARE0_Msk)
        case 10:
            return p_reg->INTENSET10 & mask;
#endif
#if defined(GRTC_INTENSET11_COMPARE0_Msk)
        case 11:
            return p_reg->INTENSET11 & mask;
#endif
#if defined(GRTC_INTENSET12_COMPARE0_Msk)
        case 12:
            return p_reg->INTENSET12 & mask;
#endif
#if defined(GRTC_INTENSET13_COMPARE0_Msk)
        case 13:
            return p_reg->INTENSET13 & mask;
#endif
#if defined(GRTC_INTENSET14_COMPARE0_Msk)
        case 14:
            return p_reg->INTENSET14 & mask;
#endif
#if defined(GRTC_INTENSET15_COMPARE0_Msk)
        case 15:
            return p_reg->INTENSET15 & mask;
#endif
       default:
            NRFX_ASSERT(false);
            return 0;
    }
}
#endif // NRF_GRTC_HAS_INT_GROUPS

#if NRF_GRTC_HAS_PWM
NRF_STATIC_INLINE void nrf_grtc_event_enable(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->EVTENSET = mask;
}

NRF_STATIC_INLINE void nrf_grtc_event_disable(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->EVTENCLR = mask;
}
#endif // NRF_GRTC_HAS_PWM

#if NRF_GRTC_HAS_EXTENDED
NRF_STATIC_INLINE void nrf_grtc_shorts_enable(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->SHORTS |= mask;
}

NRF_STATIC_INLINE void nrf_grtc_shorts_disable(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->SHORTS &= ~(mask);
}

