pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_grtc.h
NRF_STATIC_INLINE void nrf_grtc_shorts_set(NRF_GRTC_Type * p_reg, uint32_t mask)
{
    p_reg->SHORTS = mask;
}
#endif // NRF_GRTC_HAS_EXTENDED

NRF_STATIC_INLINE void nrf_grtc_subscribe_set(NRF_GRTC_Type * p_reg,
                                              nrf_grtc_task_t task,
                                              uint8_t         channel)
{
#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT((task != NRF_GRTC_TASK_START) &&
                (task != NRF_GRTC_TASK_CLEAR) &&
                (task != NRF_GRTC_TASK_STOP));
#endif

    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) task + 0x80uL)) =
            ((uint32_t)channel | NRF_SUBSCRIBE_PUBLISH_ENABLE);
}

NRF_STATIC_INLINE void nrf_grtc_subscribe_clear(NRF_GRTC_Type * p_reg,
                                                nrf_grtc_task_t task)
{
#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT((task != NRF_GRTC_TASK_START) &&
                (task != NRF_GRTC_TASK_CLEAR) &&
                (task != NRF_GRTC_TASK_STOP));
#endif

    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) task + 0x80uL)) = 0;
}

NRF_STATIC_INLINE void nrf_grtc_publish_set(NRF_GRTC_Type *  p_reg,
                                            nrf_grtc_event_t event,
                                            uint8_t          channel)
{
#if NRF_GRTC_HAS_SYSCOUNTERVALID
    NRFX_ASSERT(event != NRF_GRTC_EVENT_SYSCOUNTERVALID);
#endif
#if NRF_GRTC_HAS_RTCOUNTER
    NRFX_ASSERT(event != NRF_GRTC_EVENT_RTCOMPARESYNC);
#endif

    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80UL)) =
            ((uint32_t)channel | NRF_SUBSCRIBE_PUBLISH_ENABLE);
}

NRF_STATIC_INLINE void nrf_grtc_publish_clear(NRF_GRTC_Type *  p_reg,
                                              nrf_grtc_event_t event)
{
#if NRF_GRTC_HAS_SYSCOUNTERVALID
    NRFX_ASSERT(event != NRF_GRTC_EVENT_SYSCOUNTERVALID);
#endif
#if NRF_GRTC_HAS_RTCOUNTER
    NRFX_ASSERT(event != NRF_GRTC_EVENT_RTCOMPARESYNC);
#endif

    *((volatile uint32_t *) ((uint8_t *) p_reg + (uint32_t) event + 0x80UL)) = 0x0UL;
}

NRF_STATIC_INLINE bool nrf_grtc_event_check(NRF_GRTC_Type const * p_reg, nrf_grtc_event_t event)
{
    return nrf_event_check(p_reg, event);
}

NRF_STATIC_INLINE void nrf_grtc_event_clear(NRF_GRTC_Type * p_reg, nrf_grtc_event_t event)
{
#if NRF_GRTC_HAS_SYSCOUNTERVALID
    NRFX_ASSERT(event != NRF_GRTC_EVENT_SYSCOUNTERVALID);
#endif

    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)event)) = 0x0UL;
    nrf_event_readback((uint8_t *)p_reg + (uint32_t)event);
}

#if NRF_GRTC_HAS_RTCOUNTER
NRF_STATIC_INLINE uint32_t nrf_grtc_rt_counter_low_get(NRF_GRTC_Type const * p_reg)
{
    return p_reg->RTCOUNTERL;
}

NRF_STATIC_INLINE uint32_t nrf_grtc_rt_counter_high_get(NRF_GRTC_Type const * p_reg)
{
    return p_reg->RTCOUNTERH;
}
#endif // NRF_GRTC_HAS_RTCOUNTER

NRF_STATIC_INLINE uint32_t nrf_grtc_sys_counter_low_get(NRF_GRTC_Type const * p_reg)
{
#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
    return p_reg->GRTC_SYSCOUNTER.SYSCOUNTERL;
#else
    return p_reg->SYSCOUNTERL;
#endif // NRF_GRTC_HAS_SYSCOUNTER_ARRAY
}

NRF_STATIC_INLINE uint32_t nrf_grtc_sys_counter_high_get(NRF_GRTC_Type const * p_reg)
{
#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
    return p_reg->GRTC_SYSCOUNTER.SYSCOUNTERH;
#else
    return p_reg->SYSCOUNTERH;
#endif // NRF_GRTC_HAS_SYSCOUNTER_ARRAY
}

NRF_STATIC_INLINE uint64_t nrf_grtc_sys_counter_get(NRF_GRTC_Type const * p_reg)
{
#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
    return *((const uint64_t volatile *)&p_reg->GRTC_SYSCOUNTER.SYSCOUNTERL);
#else
    return *((const uint64_t volatile *)&p_reg->SYSCOUNTERL);
#endif // NRF_GRTC_HAS_SYSCOUNTER_ARRAY
}

NRF_STATIC_INLINE bool nrf_grtc_sys_counter_overflow_check(NRF_GRTC_Type const * p_reg)
{
#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
    return (p_reg->GRTC_SYSCOUNTER.SYSCOUNTERH &
            GRTC_SYSCOUNTER_SYSCOUNTERH_OVERFLOW_Msk) ? true : false;
#else
    return (p_reg->SYSCOUNTERH & GRTC_SYSCOUNTERH_OVERFLOW_Msk) ? true : false;
#endif // NRF_GRTC_HAS_SYSCOUNTER_ARRAY
}

#if NRF_GRTC_HAS_SYSCOUNTER_ARRAY
NRF_STATIC_INLINE uint64_t nrf_grtc_sys_counter_indexed_get(NRF_GRTC_Type const * p_reg,
                                                            uint8_t               index)
{
    NRFX_ASSERT(index < NRF_GRTC_SYSCOUNTER_COUNT);
    return *((const uint64_t volatile *)&p_reg->SYSCOUNTER[index]);
}

NRF_STATIC_INLINE void nrf_grtc_sys_counter_active_set(NRF_GRTC_Type * p_reg, bool enable)
{
    p_reg->GRTC_SYSCOUNTER.ACTIVE = ((p_reg->GRTC_SYSCOUNTER.ACTIVE &
                                     ~(GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk)) |
                                     (enable ? GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active :
                                               GRTC_SYSCOUNTER_ACTIVE_ACTIVE_NotActive));
}

NRF_STATIC_INLINE bool nrf_grtc_sys_counter_active_check(NRF_GRTC_Type const * p_reg)
{
    return (p_reg->GRTC_SYSCOUNTER.ACTIVE & GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Msk) ==
           GRTC_SYSCOUNTER_ACTIVE_ACTIVE_Active;
}
#endif // NRF_GRTC_HAS_SYSCOUNTER_ARRAY

NRF_STATIC_INLINE uint32_t nrf_grtc_event_address_get(NRF_GRTC_Type const * p_reg,
                                                      nrf_grtc_event_t      event)
{
    return (uint32_t)p_reg + (uint32_t)event;
}

NRF_STATIC_INLINE uint32_t nrf_grtc_task_address_get(NRF_GRTC_Type const * p_reg,
                                                     nrf_grtc_task_t       task)
{
    return (uint32_t)p_reg + (uint32_t)task;
}

NRF_STATIC_INLINE void nrf_grtc_task_trigger(NRF_GRTC_Type * p_reg, nrf_grtc_task_t task)
{
    *((volatile uint32_t *)((uint8_t *)p_reg + (uint32_t)task)) = 0x1UL;
}

NRF_STATIC_INLINE nrf_grtc_task_t nrf_grtc_sys_counter_capture_task_get(uint8_t cc_channel)
{
    return (nrf_grtc_task_t)NRFX_OFFSETOF(NRF_GRTC_Type, TASKS_CAPTURE[cc_channel]);
}

NRF_STATIC_INLINE void nrf_grtc_sys_counter_compare_event_enable(NRF_GRTC_Type * p_reg,
                                                                 uint8_t         cc_channel)
{

#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
#else
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT &&
                cc_channel > NRF_GRTC_MAIN_CC_CHANNEL);
#endif
    p_reg->CC[cc_channel].CCEN = GRTC_CC_CCEN_ACTIVE_Enable;
}

NRF_STATIC_INLINE void nrf_grtc_sys_counter_compare_event_disable(NRF_GRTC_Type * p_reg,
                                                                  uint8_t         cc_channel)
{
#if NRF_GRTC_HAS_EXTENDED
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT);
#else
    NRFX_ASSERT(cc_channel < NRF_GRTC_SYSCOUNTER_CC_COUNT &&
                cc_channel > NRF_GRTC_MAIN_CC_CHANNEL);
#endif
    p_reg->CC[cc_channel].CCEN = GRTC_CC_CCEN_ACTIVE_Disable;
}

NRF_STATIC_INLINE nrf_grtc_event_t nrf_grtc_sys_counter_compare_event_get(uint8_t cc_channel)
{
    return (nrf_grtc_event_t)NRFX_OFFSETOF(NRF_GRTC_Type, EVENTS_COMPARE[cc_channel]);
}

