pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/hal/nrf_grtc.h
NRF_STATIC_INLINE bool nrf_grtc_sys_counter_cc_enable_check(NRF_GRTC_Type const * p_reg,
                                                            uint8_t               cc_channel)
{
    return ((p_reg->CC[cc_channel].CCEN & GRTC_CC_CCEN_ACTIVE_Msk) >> GRTC_CC_CCEN_ACTIVE_Pos) ==
           GRTC_CC_CCEN_ACTIVE_Enable;
}

#if NRF_GRTC_HAS_EXTENDED
NRF_STATIC_INLINE void nrf_grtc_sys_counter_set(NRF_GRTC_Type * p_reg, bool enable)
{
    p_reg->MODE = ((p_reg->MODE & ~GRTC_MODE_SYSCOUNTEREN_Msk) |
                  ((enable ? GRTC_MODE_SYSCOUNTEREN_Enabled :
                  GRTC_MODE_SYSCOUNTEREN_Disabled) << GRTC_MODE_SYSCOUNTEREN_Pos));
}

NRF_STATIC_INLINE void nrf_grtc_sys_counter_auto_mode_set(NRF_GRTC_Type * p_reg, bool enable)
{
    p_reg->MODE = ((p_reg->MODE & ~GRTC_MODE_AUTOEN_Msk) |
                  ((enable ? GRTC_MODE_AUTOEN_CpuActive :
                  GRTC_MODE_AUTOEN_Default) << GRTC_MODE_AUTOEN_Pos));
}

NRF_STATIC_INLINE bool nrf_grtc_sys_counter_auto_mode_check(NRF_GRTC_Type * p_reg)
{
    return (p_reg->MODE & GRTC_MODE_AUTOEN_Msk) == GRTC_MODE_AUTOEN_CpuActive;
}

#endif // NRF_GRTC_HAS_EXTENDED

NRF_STATIC_INLINE bool nrf_grtc_sys_counter_check(NRF_GRTC_Type const * p_reg)
{
    return (p_reg->MODE & GRTC_MODE_SYSCOUNTEREN_Msk) ? true : false;
}

#if NRF_GRTC_HAS_KEEPRUNNING
NRF_STATIC_INLINE void nrf_grtc_sys_counter_active_state_request_set(NRF_GRTC_Type * p_reg,
                                                                     bool            enable)
{
#if defined(GRTC_KEEPRUNNING_DOMAIN0_Msk)
    p_reg->KEEPRUNNING = ((p_reg->KEEPRUNNING &
                          ~(GRTC_KEEPRUNNING_DOMAIN0_Active  << NRF_GRTC_DOMAIN_INDEX)) |
                          ((enable ? GRTC_KEEPRUNNING_DOMAIN0_Active :
                           GRTC_KEEPRUNNING_DOMAIN0_NotActive) << NRF_GRTC_DOMAIN_INDEX));
#else
    p_reg->KEEPRUNNING = ((p_reg->KEEPRUNNING &
                          ~(GRTC_KEEPRUNNING_REQUEST0_Active  << NRF_GRTC_DOMAIN_INDEX)) |
                          ((enable ? GRTC_KEEPRUNNING_REQUEST0_Active :
                           GRTC_KEEPRUNNING_REQUEST0_NotActive) << NRF_GRTC_DOMAIN_INDEX));
#endif
}

NRF_STATIC_INLINE
bool nrf_grtc_sys_counter_active_state_request_check(NRF_GRTC_Type const * p_reg)
{
#if defined(GRTC_KEEPRUNNING_DOMAIN0_Msk)
    return (p_reg->KEEPRUNNING &
            (GRTC_KEEPRUNNING_DOMAIN0_Active << NRF_GRTC_DOMAIN_INDEX)) ? true : false;
#else
    return (p_reg->KEEPRUNNING &
            (GRTC_KEEPRUNNING_REQUEST0_Active << NRF_GRTC_DOMAIN_INDEX)) ? true : false;
#endif
}

NRF_STATIC_INLINE
uint32_t nrf_grtc_sys_counter_active_state_request_get(NRF_GRTC_Type const * p_reg,
                                                       uint32_t              mask)
{
    return p_reg->KEEPRUNNING & mask;
}
#endif // NRF_GRTC_HAS_KEEPRUNNING

#if NRF_GRTC_HAS_EXTENDED
NRF_STATIC_INLINE void nrf_grtc_sys_counter_interval_set(NRF_GRTC_Type * p_reg, uint32_t value)
{
    p_reg->INTERVAL = value;
}

NRF_STATIC_INLINE uint32_t nrf_grtc_sys_counter_interval_get(NRF_GRTC_Type const * p_reg)
{
    return p_reg->INTERVAL;
}

NRF_STATIC_INLINE void nrf_grtc_timeout_set(NRF_GRTC_Type * p_reg, uint32_t value)
{
    NRFX_ASSERT(value <= NRF_GRTC_TIMEOUT_MAX_VALUE);
    p_reg->TIMEOUT = (value << GRTC_TIMEOUT_VALUE_Pos);
}

NRF_STATIC_INLINE uint32_t nrf_grtc_timeout_get(NRF_GRTC_Type const * p_reg)
{
    return (p_reg->TIMEOUT >> GRTC_TIMEOUT_VALUE_Pos);
}

NRF_STATIC_INLINE void nrf_grtc_waketime_set(NRF_GRTC_Type * p_reg, uint32_t value)
{
    NRFX_ASSERT(value <= NRF_GRTC_WAKETIME_MAX_VALUE);
    p_reg->WAKETIME = (value << GRTC_WAKETIME_VALUE_Pos);
}

NRF_STATIC_INLINE uint32_t nrf_grtc_waketime_get(NRF_GRTC_Type const * p_reg)
{
    return (p_reg->WAKETIME >> GRTC_WAKETIME_VALUE_Pos);
}
#endif // NRF_GRTC_HAS_EXTENDED

#if NRF_GRTC_HAS_PWM
NRF_STATIC_INLINE void nrf_grtc_pwm_compare_set(NRF_GRTC_Type * p_reg, uint32_t value)
{
    p_reg->PWMCONFIG = (value << GRTC_PWMCONFIG_COMPAREVALUE_Pos) & GRTC_PWMCONFIG_COMPAREVALUE_Msk;
}

NRF_STATIC_INLINE uint32_t nrf_grtc_pwm_compare_get(NRF_GRTC_Type const * p_reg)
{
    return (p_reg->PWMCONFIG >> GRTC_PWMCONFIG_COMPAREVALUE_Pos);
}
#endif // NRF_GRTC_HAS_PWM

#if NRF_GRTC_HAS_CLKOUT
NRF_STATIC_INLINE void nrf_grtc_clkout_set(NRF_GRTC_Type *   p_reg,
                                           nrf_grtc_clkout_t clkout,
                                           bool              enable)
{
    if (enable)
    {
        p_reg->CLKOUT |= (uint32_t)clkout;
    }
    else
    {
        p_reg->CLKOUT &= ~((uint32_t)clkout);
    }
}

NRF_STATIC_INLINE bool nrf_grtc_clkout_enable_check(NRF_GRTC_Type const * p_reg,
                                                    nrf_grtc_clkout_t     clkout)
{
    return p_reg->CLKOUT == (uint32_t)clkout;
}

NRF_STATIC_INLINE void nrf_grtc_clkout_divider_set(NRF_GRTC_Type * p_reg, uint32_t value)
{
    NRFX_ASSERT(value <= NRF_GRTC_CLKCFG_CLKFASTDIV_MAX_VALUE);
    p_reg->CLKCFG = (p_reg->CLKCFG & ~GRTC_CLKCFG_CLKFASTDIV_Msk) |
                    ((value & GRTC_CLKCFG_CLKFASTDIV_Msk) << GRTC_CLKCFG_CLKFASTDIV_Pos);
}

NRF_STATIC_INLINE uint32_t nrf_grtc_clkout_divider_get(NRF_GRTC_Type const * p_reg)
{
    return (p_reg->CLKCFG & GRTC_CLKCFG_CLKFASTDIV_Msk) >> GRTC_CLKCFG_CLKFASTDIV_Pos;
}
#endif // NRF_GRTC_HAS_CLKOUT

#if NRF_GRTC_HAS_CLKSEL
NRF_STATIC_INLINE void nrf_grtc_clksel_set(NRF_GRTC_Type * p_reg, nrf_grtc_clksel_t clksel)
{
    p_reg->CLKCFG = (p_reg->CLKCFG & ~GRTC_CLKCFG_CLKSEL_Msk) |
                    (clksel << GRTC_CLKCFG_CLKSEL_Pos);
}

NRF_STATIC_INLINE nrf_grtc_clksel_t nrf_grtc_clksel_get(NRF_GRTC_Type const * p_reg)
{
    return (nrf_grtc_clksel_t)((p_reg->CLKCFG & GRTC_CLKCFG_CLKSEL_Msk) >> GRTC_CLKCFG_CLKSEL_Pos);
}
#endif // NRF_GRTC_HAS_CLKSEL

#endif // NRF_DECLARE_ONLY

/** @} */

#ifdef __cplusplus
}
#endif

#endif  /* NRF_GRTC_H */
